cf/Documents/Бюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Бюджет</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Бюджетирование</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АналитикиСтатейБюджета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики1</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики2</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипАналитики3</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикиСтатейБюджета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийСтр</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/Бюджет/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	         
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	|ВЫБРАТЬ
	|	Автор, Ответственный, ДатаНачала, ДатаОкончания, Сценарий
	|ИЗ
	|	Документ.Бюджет
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	Ссылка.Отдел Отдел,
	|Ссылка.Сценарий Сценарий, 
	|Ссылка.МодельБюджета МодельБюджета,
	|СтатьяБюджета,
	|СтатьяБюджета.Коэффициент Коэф,
	|Аналитика1,  Аналитика2, Аналитика3, 
	|   Сумма(Значение1),Сумма(Значение2),Сумма(Значение3),Сумма(Значение4),Сумма(Значение5),Сумма(Значение6),Сумма(Значение7),Сумма(Значение8),Сумма(Значение9),Сумма(Значение10),Сумма(Значение11),Сумма(Значение12),
	|   ДатаВремя(1,1,1) Период,0 Сумма,0 СуммаФакт
	|ИЗ 
	|	Документ.Бюджет.Показатели 
	|ГДЕ 
	|	Ссылка = &Ссылка
	|СГРУППИРОВАТЬ
	|По Ссылка.Отдел ,Ссылка.Сценарий , Ссылка.МодельБюджета , СтатьяБюджета, Аналитика1,  Аналитика2, Аналитика3, ДатаВремя(1,1,1)
	|");
	

	//Запрос.УстановитьПараметр("Область", 		ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	
	Шапка=КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить());
	ДополнительныеСвойства.Вставить("Шапка", Шапка);
	
	ТЧ=Пакет[2].Выгрузить();
	Периоды=ПолучитьПериоды(Шапка.ДатаНачала,Шапка.ДатаОкончания,Шапка.Сценарий);
	
	Бюджетирование=ТЧ.СкопироватьКолонки();
	Для Н=1 По Периоды.Количество() Цикл
		ТекПериод = Периоды[Н-1];
		Для Каждого Стр Из ТЧ Цикл
			НовСтр=Бюджетирование.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			Новстр.Период=ТекПериод;
			НовСтр.Сумма=Стр["Значение"+Н]* ?(Стр.Коэф=0,1,Стр.Коэф);
		КонецЦикла;
	КонецЦикла;	
	
	ДополнительныеСвойства.Вставить("Бюджетирование", Бюджетирование);
	
КонецПроцедуры

Функция ПолучитьПериоды(ДатаНачала,ДатаОкончания,Сценарий) Экспорт
	
	МассивПериодов=Новый Массив;
	
	Если ЗначениеЗаполнено(ДатаНачала) и ЗначениеЗаполнено(ДатаОкончания) и ЗначениеЗаполнено(Сценарий) Тогда
		
		ПериодичностьСтр=Строка(Сценарий.Периодичность);
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"Выбрать Выразить(&ДатаНач КАК Дата)  ТекПериод
		|объединить все
		|выбрать НачалоПериода(&ДатаКон,"+ПериодичностьСтр+")
		|Упорядочить по ТекПериод
		|Итоги  по ТекПериод Периодами("+ПериодичностьСтр+",&ДатаНач,&ДатаКон)"
		;
		Запрос.УстановитьПараметр("ДатаНач",ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",ДатаОкончания);
		
		Рез=Запрос.Выполнить();
		Выборка=Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ТекПериод", "Все");
		Пока Выборка.Следующий() Цикл
			МассивПериодов.Добавить(Выборка.ТекПериод);
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат МассивПериодов;
	
КонецФункции
